In [1]:
import pandas as pd
import numpy as np

In [5]:
# load data
df=pd.read_excel('Excel Dashboard.xlsx', sheet_name='Employees')

In [35]:
# get the data type
type(df)

pandas.core.frame.DataFrame

In [6]:
# check the data types
df.dtypes

FULL NAMES                    object
Department                    object
SALARY                         int64
Departmental Bonus             int64
Managers                      object
ID                             int64
Inventory ID                   int64
Hire Date             datetime64[ns]
dtype: object

In [14]:
# convert salary and departmental bonus to float data type
df=df.astype({'SALARY':'float','Departmental Bonus':'float'})

In [15]:
df.dtypes

FULL NAMES                    object
Department                    object
SALARY                       float64
Departmental Bonus           float64
Managers                      object
ID                             int64
Inventory ID                   int64
Hire Date             datetime64[ns]
dtype: object

In [21]:
#check the first 5 rows
df.head(5)

,FULL NAMES,Department,SALARY,Departmental Bonus,Managers,ID,Inventory ID,Hire Date
0,André Fonseca,Production,3500.0,350.0,Felix Kern,1,10,1997-10-23
1,Ann devon,Engineer,4003.0,250.0,Ishmail Ahmed,2,11,1997-11-05
2,Annette Roulet,IT,3000.0,200.0,Brian Hart,3,12,1997-11-06
3,aria cruz,Production,5000.0,350.0,Felix Kern,4,13,1997-11-26
4,Becky David,Production,2000.0,350.0,Felix Kern,5,14,1998-01-12

In [17]:
# check only Department cologne
df['Department']

0      Production
1        Engineer
2              IT
3      Production
4      Production
          ...
128    Production
129    Production
130            IT
131    Production
132            IT
Name: Department, Length: 133, dtype: object

In [22]:
#check the bottom 5 rows
df.tail(5)

,FULL NAMES,Department,SALARY,Departmental Bonus,Managers,ID,Inventory ID,Hire Date
128,Victoria Ashworth,Production,4000.0,350.0,Tina Turner,129,138,1996-10-16
129,yang wang,Production,4000.0,350.0,Nikola Market,130,139,1996-10-29
130,Yetunde Oladele,IT,2000.0,200.0,Felix Kern,131,140,1996-11-25
131,Yoshi Latimer,Production,5000.0,350.0,Nikola Market,132,141,1997-03-11
132,Yoshi Tannamuri,IT,2200.0,200.0,Ishmail Ahmed,133,142,1997-04-18

In [25]:
# get the shape attribute to know the numbers of column and rows
df.shape

(133, 8)

In [28]:
# get the column names
df.columns

Index(['FULL NAMES', 'Department', 'SALARY', 'Departmental Bonus', 'Managers',
       'ID', 'Inventory ID', 'Hire Date'],
      dtype='object')

In [29]:
# get the rows
df.index

RangeIndex(start=0, stop=133, step=1)

In [30]:
# get only Department column
df['Department']

0      Production
1        Engineer
2              IT
3      Production
4      Production
          ...
128    Production
129    Production
130            IT
131    Production
132            IT
Name: Department, Length: 133, dtype: object

In [23]:
# count the unique deaprtment to know the department with the highest numbers of employees
df.value_counts('Department')

Department
IT            32
Production    28
Sales         24
Engineer      19
HR            12
Finance       10
Marketing      8
dtype: int64

In [31]:
# get the dataframe description
df.describe()

            SALARY  Departmental Bonus         ID  Inventory ID
count   133.000000          133.000000  133.00000     133.00000
mean   3376.165414          309.398496   67.00000      76.00000
std     813.151996          130.869814   38.53786      38.53786
min    2000.000000          100.000000    1.00000      10.00000
25%    3000.000000          200.000000   34.00000      43.00000
50%    3500.000000          250.000000   67.00000      76.00000
75%    4000.000000          350.000000  100.00000     109.00000
max    5000.000000          550.000000  133.00000     142.00000

In [32]:
# change salary and bonus datatype back to int
df=df.astype({'SALARY':'int64','Departmental Bonus':'int64'})

In [33]:
df.dtypes

FULL NAMES                    object
Department                    object
SALARY                         int64
Departmental Bonus             int64
Managers                      object
ID                             int64
Inventory ID                   int64
Hire Date             datetime64[ns]
dtype: object

In [37]:
# get the data type of a column
type(df['Department'])

pandas.core.series.Series

In [42]:
# change the column to upper case
df.columns=df.columns.str.upper()
df.head(2)

,FULL NAMES,DEPARTMENT,SALARY,DEPARTMENTAL BONUS,MANAGERS,ID,INVENTORY ID,HIRE DATE
0,André Fonseca,Production,3500,350,Felix Kern,1,10,1997-10-23
1,Ann devon,Engineer,4003,250,Ishmail Ahmed,2,11,1997-11-05

In [48]:
# rename Hire Date to Start Date
df=df.rename(columns=({'HIRE DATE':'START DATE'}))
df.head(2)

,FULL NAMES,DEPARTMENT,SALARY,DEPARTMENTAL BONUS,MANAGERS,ID,INVENTORY ID,START DATE
0,André Fonseca,Production,3500,350,Felix Kern,1,10,1997-10-23
1,Ann devon,Engineer,4003,250,Ishmail Ahmed,2,11,1997-11-05

In [54]:
df.head(1)

,FULL NAMES,DEPARTMENT,SALARY,DEPARTMENTAL BONUS,MANAGERS,ID,INVENTORY ID,START DATE
0,André Fonseca,Production,3500,350,Felix Kern,1,10,1997-10-23

In [77]:
# add a new column, name it Company and enter JulieChan AG inside every row
df['COMPANY'] = 'Julie Chan AG'

In [78]:
df.head(5)

,FULL NAMES,DEPARTMENT,SALARY,DEPARTMENTAL BONUS,MANAGERS,ID,INVENTORY ID,START DATE,Company,Employee_id,COMPNAY,COMPANY
0,André Fonseca,Production,3500,350,Felix Kern,1,10,1997-10-23,Julie Chan AG,Emp_id,Julie Chan AG,Julie Chan AG
1,Ann devon,Engineer,4003,250,Ishmail Ahmed,2,11,1997-11-05,Julie Chan AG,Emp_id,Julie Chan AG,Julie Chan AG
2,Annette Roulet,IT,3000,200,Brian Hart,3,12,1997-11-06,Julie Chan AG,Emp_id,Julie Chan AG,Julie Chan AG
3,aria cruz,Production,5000,350,Felix Kern,4,13,1997-11-26,Julie Chan AG,Emp_id,Julie Chan AG,Julie Chan AG
4,Becky David,Production,2000,350,Felix Kern,5,14,1998-01-12,Julie Chan AG,Emp_id,Julie Chan AG,Julie Chan AG

In [75]:
# create a new column and name it employee id. generate id from 1 to 133 and also make the new column the index
Emp_id=np.arange(0,133)

In [79]:
df['EMP_ID']=Emp_id

In [ ]:
# Delete Employee_id	COMPNAY column
df.drop(columns=['COMPNAY', 'Employee_id'], inplace=True)

In [93]:
df.head(2)

,FULL NAMES,DEPARTMENT,SALARY,DEPARTMENTAL BONUS,MANAGERS,ID,INVENTORY ID,START DATE,COMPANY,EMP_ID
0,André Fonseca,Production,3500,350,Felix Kern,1,10,1997-10-23,Julie Chan AG,0
1,Ann devon,Engineer,4003,250,Ishmail Ahmed,2,11,1997-11-05,Julie Chan AG,1

In [110]:
# calculate the total sum of salary paid to all workers
sum(df['SALARY'])

449030

In [95]:
df['SALARY'].sum()

449030

In [100]:
# now create a new column and name it Total Salary. Add the salary and bonus to get the values for the new column
df['Total Income'] = df['SALARY'] + df['DEPARTMENTAL BONUS']

In [102]:
df.head(2)

,FULL NAMES,DEPARTMENT,SALARY,DEPARTMENTAL BONUS,MANAGERS,ID,INVENTORY ID,START DATE,COMPANY,EMP_ID,Total Income
0,André Fonseca,Production,3500,350,Felix Kern,1,10,1997-10-23,Julie Chan AG,0,3850
1,Ann devon,Engineer,4003,250,Ishmail Ahmed,2,11,1997-11-05,Julie Chan AG,1,4253

In [104]:
# now create a new column and name it Average Salary. use the salary and bonus to get the values for the new column
df['Average Income'] = df['SALARY'] + df['DEPARTMENTAL BONUS'] / 2

In [106]:
df.head(2)

,FULL NAMES,DEPARTMENT,SALARY,DEPARTMENTAL BONUS,MANAGERS,ID,INVENTORY ID,START DATE,COMPANY,EMP_ID,Total Income,Average Income
0,André Fonseca,Production,3500,350,Felix Kern,1,10,1997-10-23,Julie Chan AG,0,3850,3675.0
1,Ann devon,Engineer,4003,250,Ishmail Ahmed,2,11,1997-11-05,Julie Chan AG,1,4253,4128.0

In [118]:
df=df.set_index('EMP_ID')

In [120]:
df.head(2)

,FULL NAMES,DEPARTMENT,SALARY,DEPARTMENTAL BONUS,MANAGERS,ID,INVENTORY ID,START DATE,COMPANY,Total Income,Average Income
EMP_ID,,,,,,,,,,,
0,André Fonseca,Production,3500,350,Felix Kern,1,10,1997-10-23,Julie Chan AG,3850,3675.0
1,Ann devon,Engineer,4003,250,Ishmail Ahmed,2,11,1997-11-05,Julie Chan AG,4253,4128.0

In [121]:
#save this as a csv file
df.to_csv('Data_csv')